some document cleanup
